// Задача 27: Напишите программу, которая принимает на вход число 
// и выдаёт сумму цифр в числе.

// 452 -> 11

// 82 -> 10

// 9012 -> 12

Console.WriteLine("Введите число А: ");
int Number_A = Convert.ToInt32(Console.ReadLine());

Console.WriteLine($"число А: {Number_A}");

result01 =  

